"""
Lesson 78
10.12.2023
# Тема: Marshmallow
Поля
- String - Строки
- Integer - Целые числа
- Float - Числа с плавающей точкой
- Boolean - Булевые значения
- Date - Дата
- DateTime - Дата и время
- Time - Время
- Url - Ссылка
- Email - Почта
- List - Список
- Dict - Словарь
- Nested - Вложенные схемы!)
- Function - Результат выполнения функции

Параметры полей
- required - Обязательное поле. По умолчанию False. Если True, то поле не может быть пустым
- allow_none - Разрешить None для поля. По умолчанию False
- default - Значение по умолчанию при процессе сериализации
- missing - Значение по умолчанию при процессе десериализации
- validate - Валидатор. Имеет свои инструменты
- load_only - Только при загрузке данных
- dump_only - Только при выгрузке данных
"""
