"""
Lesson 28
29.10.2023

Тема: Наследование в ООП

- Концепция наследования в ООП
"""


# Наследование в программировании является одним из ключевых понятий
# объектно-ориентированного программирования (ООП).
# С его помощью новые классы могут быть созданы на основе существующих классов,
# при этом новые (производные) классы наследуют элегантно свойства и методы
# родительского класса. Это позволяет избегать дублирования кода и упрощает
# добавление новых функциональностей в программу.

# Синта́ксис наследования в Python:

class Parent:  # Базовый класс
    pass


class Child(Parent):  # Производный класс наследует от базового класса Parent
    pass
