
# Домашнее задание 📃

**"Погодный Аналитик с Marshmallow и Dataclasses"**

### Краткое содержание
В этом задании Вы будете работать с реальными данными погоды, используя Python. Ваша задача – написать программу, которая запрашивает данные о погоде с использованием предоставленного API, анализирует их и сохраняет структурированно. Вы будете использовать dataclasses для структурирования данных и библиотеку Marshmallow для валидации и сериализации.

### Описание Задания
1. **Использование API для получения погодных данных:**
   - Используйте предоставленный код для запроса данных о погоде с OpenWeatherMap API.

```python
import requests

def get_weather(city_name):
    api_key = "ВАШ_API_КЛЮЧ" # Можете взять мой. 23496c2a58b99648af590ee8a29c5348
    base_url = "https://api.openweathermap.org/data/2.5/weather"
    params = {
        'q': city_name,
        'lang': 'ru',
        'units': 'metric',
        'appid': api_key
    }
    response = requests.get(base_url, params=params)
    return response.json()

# Пример использования
city = "Москва"
weather_data = get_weather(city)
print(weather_data)

```


2. **Создание Dataclass `CurrentWeather`:**
   - Определите датакласс `CurrentWeather`, включающий интересные Вам поля из ответа API. Некоторые поля должны быть обязательными, другие – необязательными.

3. **Реализация схемы Marshmallow:**
   - На основе датакласса `CurrentWeather` создайте схему Marshmallow.
   - Расширьте созданную схему, добавив в неё дополнительные проверки (например, проверка на диапазон значений, формат даты).

4. **Генерация JSON Schema:**
   - Используйте библиотеку `marshmallow_jsonschema` для преобразования вашей схемы Marshmallow в JSON Schema.
   - Сохраните сгенерированную схему в файл.

5. **Творческий аспект:**
   - Выбор полей для датакласса и методов проверки остаётся за Вами. Будьте творческими и выберите те поля, которые считаете наиболее интересными и показательными.


### Примерная Структура Кода
```python
# Импорты и определение классов/схем здесь

# Здесь код для запроса данных о погоде и их обработки (пользовательский ввод через инпут)

# Создание экземпляра датакласса

# Валидация и сериализация данных с помощью Marshmallow

# Генерация и сохранение JSON Schema

# Вывод погоды в терминал

if __name__ == "__main__":
    validate_it = Validate()
    validate_it()
```

Это задание предназначено для развития навыков работы с внешними API, обработки и валидации данных, а также работы с сериализацией. Удачи!

# Критерии проверки 👌

- Чистота и структура кода.
- Эффективное использование dataclasses.
- Корректное применение библиотек marshmallow, marshmallow_dataclass и marshmallow_jsonschema.
- Работа сдается в виде одного файла .py.
- При запуске кода 
	- запрос города
	- получение данных
	- валидация данных
	- десериализация данных данных
	- отображение погоды в городе
	- должна генерироваться JSON Schema (опционально: можете сделать проверку, если файл уже есть - чтобы он не писался)
- Хорошая документация (модуль, т.е. файл + классы + методы)

